// 1.
// Створити змінні для зберігання температури за Цельсієм та Фаренгейтом. Перевести температуру з Цельсія у Фаренгейти за допомогою формули та вивести результат в консоль
const celsiusTemperature = 40;
const fahrenheitTemperature = (celsiusTemperature * 9/5) + 32;
console.log(celsiusTemperature + " градусів Цельсія дорівнює " + fahrenheitTemperature + " градусів Фаренгейта.");

// 2.
// Створити змінну для зберігання кількості днів у місяці. Обчислити кількість годин та хвилин у цьому місяці за допомогою оператора множення та вивести результат в консоль.
const daysMonth = 31;
const hours = daysMonth + 24;
const min = hours * 60;
console.log('В місяці всього' + hours + 'годин' + min + 'хвилин' );

// 3.
// Створити змінні для зберігання рівня здоров'я та енергії гравця в грі. Зменшити рівень здоров'я та енергії гравця за допомогою операторів віднімання та вивести результат в консоль.
const health = 70;
const energy = 40;
const healthMinus = 20;
const energyMinus = 10;
console.log('Початковий рівень здоровя гравця:>>' + health);
console.log('Початковий рівень енергії гравця:>>' + energy);
console.log('Рівень здоровя гравця після урону:>>', (health - healthMinus));
console.log('Рівень енергії гравця після урону:>>', (energy - energyMinus));

// 4.
// Створити змінну для зберігання суми покупки в магазині. Застосувати знижку в розмірі 10% до цієї суми за допомогою оператора множення та вивести результат в консоль.

// 5.
// Створити змінну для зберігання числа з плаваючою комою. Використати метод Math.floor() для округлення числа до меншого та вивести результат в консоль.
const number = 8.62;
console.log('Початкове число:>>' + number);
console.log("Округлене число до меншого:>> " + Math.floor(number));

// 6.
// Створити змінну для зберігання рядка, який містить числа з плаваючою комою. Використати метод parseFloat() для перетворення рядка у десяткове число та вивести результат в консоль
console.log(Number.parseFloat('3.49768'));

// 7.
// Створити змінну для зберігання рядка, який містить ціле число. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль.
console.log(Number.parseInt('77'));

// 8.
// Створити змінну для зберігання числа. Використати метод Math.sqrt() для обчислення квадратного кореня числа та вивести результат в консоль.
const numberTo = 121;
console.log("Число: " + numberTo);
console.log('Квадратний корінь числа:>>' +  Math.sqrt(numberTo));

// 9.
// Створити змінні для зберігання цілочисельного значення та рядка з числом у вигляді рядка. Використати метод parseInt() для перетворення рядка у ціле число та вивести результат в консоль. Потім використати метод toString() для перетворення цілочисельного значення у рядок та вивести результат в консоль.
const num = 737;
const str = '738';
console.log(parseInt(str));
console.log(String(num));